## 25. String1
### basic1 데이터에서 f4가 E로 시작하면서 부산에 살고 20대인 사람은 몇 명일까요?

In [1]:
import pandas as pd

df = pd.read_csv('../data/basic1.csv')

df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [2]:
df['city'].value_counts()

경기    41
서울    20
대구    20
부산    19
Name: city, dtype: int64

In [9]:
search = df[(df['f4'].str.startswith('E')) & (df['city']=='부산') &((df['age'] >= 20)&(df['age']<30))]

In [53]:
search

Empty DataFrame
Columns: [id, age, city, f1, f2, f3, f4, f5]
Index: []

In [11]:
len(search)

0

<br><br>

## 26. String2
### payment.csv의 menu컬럼에 "라떼" 키워드가 있는 데이터의 수는?

In [13]:
import pandas as pd

df = pd.read_csv('../data/payment.csv')
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [25]:
latte = df[df['menu'].str.contains('라떼')]
latte

        date  hour    menu  price
0   20221129    13    딸기라떼   4000
1   20221130    12    카페라떼   3000
2   20221201    14   바닐라라떼   3500
3   20221201    16    초코라떼   3500
4   20221202    17    모카라떼   3500
5   20221202    12   카라멜라떼   3500
6   20221203     8   챠이 라떼   3500
8   20221203    15   오곡 라떼   4000
11  20221225    14  토피넛 라떼   4000
12  20221225    16   카페 라떼   3000

In [26]:
len(latte)

10

<br><br>
## 27. String3
### 바닐라라떼 5점, 카페라떼 3점, 아메리카노 2점, 나머지 0점이다. 총 메뉴의 점수를 더한 값은?

In [27]:
import pandas as pd

df = pd.read_csv('../data/payment.csv')
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [39]:
# 데이터프레임 복사
menu_score = df.copy()

menu_score['menu'] = menu_score['menu'].replace({'바닐라라떼':'5', '카페라떼':'3', '아메리카노':'2'})

In [40]:
menu_score

        date  hour    menu  price
0   20221129    13    딸기라떼   4000
1   20221130    12       3   3000
2   20221201    14       5   3500
3   20221201    16    초코라떼   3500
4   20221202    17    모카라떼   3500
5   20221202    12   카라멜라떼   3500
6   20221203     8   챠이 라떼   3500
7   20221203     9       2   2000
8   20221203    15   오곡 라떼   4000
9   20221203    16       2   2000
10  20221225    10       2   2000
11  20221225    14  토피넛 라떼   4000
12  20221225    16   카페 라떼   3000

In [51]:
sum_ = menu_score['menu'][menu_score['menu'].str.isdigit()]
sum_ = sum_.astype('int')

In [52]:
sum_.sum()

14